-- GENERATED: 0002_seed_events.sql

-- t_events seed

INSERT INTO t_events (f_event_id, f_event_code, f_event_name, f_time, f_duration, f_place, f_gather_time, f_summary) VALUES
('1', 'C', '開場', '0930', '20', 'クラス所定入口', '0930', ''),
('2', 'A', '出席確認①', '1000', '10', '2Fクラス指定席', '1000', ''),
('3', 'C', '開会式', '1015', '10', '2Fクラス指定席', '1000', ''),
('4', 'E', '走れ！〇人〇脚！', '1030', '50', '集合場所A', '1015', ''),
('5', 'E', '8人×50mチャレンジ', '1030', '50', '集合場所B', '1030', ''),
('6', 'E', '真のストライカーは君だ!!', '1130', '50', '集合場所A', '1130', ''),
('7', 'E', '昼休憩コスプレ大会', '1230', '30', '集合場所A', '1230', ''),
('8', 'A', '出席確認②', '1300', '10', '2Fクラス指定席', '1300', ''),
('9', 'E', '四天王ドッチボール', '1330', '50', '集合場所A', '1330', ''),
('10', 'E', 'HALダービーレクリエイション杯', '1430', '20', '集合場所A', '1430', ''),
('11', 'E', '学科別対抗リレー', '1500', '20', '集合場所A', '1500', ''),
('12', 'A', '出席確認', '1530', '10', '2Fクラス指定席', '1530', ''),
('13', 'C', '閉会式', '1545', '15', '2Fクラス指定席', '1545', '');

